src/cf/Documents/Спецификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Спецификация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьВДиалоге1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьВДиалоге2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьВДиалоге3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потери</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпецификацияКомплектующей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпецификацияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьДоКоличествоЗнаков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантИспользованияВПроизводственномЦикл</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИспользованиеВПроизводственномЦикл</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзделия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРазворачивать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОкругления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Операции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантИспользованияВПроизводственномЦикл</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИспользованиеВПроизводственномЦикл</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПобочныеПродукты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПобочныйПродукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаПобочногоПродукта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантИспользованияВПроизводственномЦикл</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИспользованиеВПроизводственномЦикл</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьДоКоличествоЗнаков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/Спецификация/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
//Управление спецификацией

Функция ПолучитьСпецификациюНаДату(ВариантСпецификации, ХарактеристикаНоменклатуры=Неопределено, НаДату=Неопределено) Экспорт
	Если ВариантСпецификации.Пустая() Тогда Возврат Неопределено; КонецЕсли; 

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Спецификация", ВариантСпецификации);
	Запрос.УстановитьПараметр("Дата", КонецДня(?(НаДату=Неопределено, ТекущаяДата(), НаДату)));
	Если ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	КонецЕсли;
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсточникДанных.Ссылка КАК Документ
	|ИЗ
	|	Документ.Спецификация КАК ИсточникДанных
	|ГДЕ
	|   ИсточникДанных.Дата <= &Дата
	| 	И ИсточникДанных.Спецификация = &Спецификация
	| 	"+?(ЗначениеЗаполнено(ХарактеристикаНоменклатуры), "И ИсточникДанных.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры", "")+"
	| 	И ИсточникДанных.Проведен 
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникДанных.Дата УБЫВ
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Документ, Неопределено);
КонецФункции

Функция ПолучитьВариантСпецификации(СпецификацияСсылка, НоменклатураСсылка, Сообщить=Ложь) Экспорт
	Если Не СпецификацияСсылка.Пустая() Тогда Возврат СпецификацияСсылка; КонецЕсли;

	Спецификация=НоменклатураСсылка.ОсновнаяСпецификация;
	Если Спецификация.Пустая() Тогда
		ВыборкаСпецификации=Справочники.СпецификацияНоменклатуры.Выбрать(,НоменклатураСсылка,,"Код Возр");
		Если Не ВыборкаСпецификации.Следующий() Тогда
			Если Сообщить Тогда
				#Если Клиент Тогда
				Сообщить("Изделие <"+СокрЛП(НоменклатураСсылка)+"> не имеет спецификаций!");
				#КонецЕсли
			КонецЕсли;
			Возврат Неопределено;
		КонецЕсли;
		Спецификация=ВыборкаСпецификации.Ссылка;
	КонецЕсли;
	
	Возврат Спецификация;
КонецФункции 

////////////////////////////////////////////////////////////////////////////////
//Управление печатными формами

Процедура СтруктураПечатныхФорм(Структура) Экспорт
	Структура.Вставить("Спецификация", "Спецификация по комплектующим");
КонецПроцедуры

Функция ИнициализацияМакета(СтруктураПараметров, стрМакет)
	Если СтруктураПараметров.Свойство("Макет") Тогда
		Возврат СтруктураПараметров.Макет;
	КонецЕсли;
	Макет=СтруктураПараметров.МакетШаблон;
	Если Макет=Неопределено Тогда
		Если Метаданные.ОбщиеМакеты.Найти(стрМакет)=Неопределено Тогда
			Макет=ПолучитьМакет(стрМакет);
		Иначе
			Макет=ПолучитьОбщийМакет(стрМакет);
		КонецЕсли;
	КонецЕсли;
	Возврат Макет;
КонецФункции

Функция ПолучитьСпецификациюНоменклатуры(НаДату, Номенклатура)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Дата", НаДату);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокСпецификация.Дата,
	|	ДокСпецификация.Спецификация,
	|	ДокСпецификация.Номенклатура,
	|	ДокСпецификация.Номенклатура.Артикул КАК Артикул,
	|	ДокСпецификация.Комплектующие.(
	|		Ссылка,
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура.Артикул КАК Артикул,
	|		ХарактеристикаНоменклатуры,
	|		СтатьяЗатрат,
	|		Количество,
	|		ЕдиницаИзмерения,
	|		ДоляСтоимости,
	|		Потери,
	|		СпецификацияКомплектующей,
	|		НормаРасхода,
	|		ОкруглятьДоКоличествоЗнаков,
	|		ВариантИспользованияВПроизводственномЦикл
	|	)
	|ИЗ
	|	Документ.Спецификация КАК ДокСпецификация
	|ГДЕ
	|	ДокСпецификация.Дата <= &Дата
	|	И ДокСпецификация.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокСпецификация.Дата УБЫВ
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат "";
КонецФункции

Функция Печать_Спецификация(СтруктураПараметров)
	СсылкаНаОбъект=СтруктураПараметров.СсылкаНаОбъект;

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.Текст="ВЫБРАТЬ
	             |	ДокСпецификация.Дата,
	             |	ДокСпецификация.Спецификация,
	             |	ДокСпецификация.Номенклатура,
	             |	ДокСпецификация.Номенклатура.Артикул КАК Артикул,
	             |	ДокСпецификация.ПоследнийАвтор КАК ПослАвтор,
	             |	ДокСпецификация.Комплектующие.(
	             |		Ссылка,
	             |		НомерСтроки,
	             |		Номенклатура,
	             |		Номенклатура.Артикул КАК Артикул,
	             |		ХарактеристикаНоменклатуры,
	             |		СтатьяЗатрат,
	             |		Количество,
	             |		ЕдиницаИзмерения,
	             |		ДоляСтоимости,
	             |		Потери,
	             |		СпецификацияКомплектующей,
	             |		НормаРасхода,
	             |		ОкруглятьДоКоличествоЗнаков,
	             |		ВариантИспользованияВПроизводственномЦикл
	             |	)
	             |ИЗ
	             |	Документ.Спецификация КАК ДокСпецификация
				 |ГДЕ
				 |	ДокСпецификация.Ссылка=&Ссылка";
		 
	Шапка=Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	тзКомплектующие=Шапка.Комплектующие.Выгрузить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Спецификация";

	Макет = ИнициализацияМакета(СтруктураПараметров, "Спецификация");
    ОбластьШапки=Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьШапки);
	
	Н=1;
	Для каждого Строка Из тзКомплектующие Цикл	
		ОбластьМакета1=Макет.ПолучитьОбласть("Область1");
		ОбластьМакета1.Параметры.Заполнить(Строка);
		ОбластьМакета1.Параметры.Н=Н;
		ТабДокумент.Вывести(ОбластьМакета1);
		Н=Н+1;
		
		СпецификацияКомплектующей=ПолучитьСпецификациюНоменклатуры(Шапка.Дата, Строка.Номенклатура);
		Если СпецификацияКомплектующей="" Тогда Продолжить; КонецЕсли;
		тзКомплектующие1=СпецификацияКомплектующей.Комплектующие.Выгрузить();		
		Н1=1;
		Для каждого Строка1 Из тзКомплектующие1 Цикл
			ОбластьМакета2=Макет.ПолучитьОбласть("Область2");
			ОбластьМакета2.Параметры.Заполнить(Строка1);
			ОбластьМакета2.Параметры.Н=Н1;
			ТабДокумент.Вывести(ОбластьМакета2);
			Н1=Н1+1;		
			СпецификацияКомплектующей=ПолучитьСпецификациюНоменклатуры(Шапка.Дата, Строка1.Номенклатура);
			Если СпецификацияКомплектующей="" Тогда Продолжить; КонецЕсли;
			тзКомплектующие2=СпецификацияКомплектующей.Комплектующие.Выгрузить();
			Н2=1;
			Для каждого Строка2 Из тзКомплектующие2 Цикл
				ОбластьМакета3=Макет.ПолучитьОбласть("Область3");
				ОбластьМакета3.Параметры.Заполнить(Строка2);
				ОбластьМакета3.Параметры.Н=Н2;
				ТабДокумент.Вывести(ОбластьМакета3);
				Н2=Н2+1;
			КонецЦикла;			
		КонецЦикла; 
	КонецЦикла; 
	
	ОбластьПодвала=Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвала.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьПодвала);
	
	Возврат ТабДокумент;
КонецФункции

Функция Печать(СтруктураПараметров, КоличествоЭкземпляров=1, НаПринтер=Ложь, ТабДокумент=Неопределено) Экспорт
	Если СтруктураПараметров.ИмяМакета="Спецификация" Тогда
		ТабДокумент=Печать_Спецификация(СтруктураПараметров);
	КонецЕсли;
    Возврат ТабДокумент;
КонецФункции
